[VCP_WarpWarden X2EncyclopediaTemplate]
ListTitle = "异域界卫"
DescriptionTitle = "异域界卫"
DescriptionEntry = "异域界卫是一位身披重甲的灵能防御者，手持一面蕴含巨大能量的护盾，保护盟友并掌控战场。他们运用高超的灵能能力，生成屏障、吸收敌人火力，并发动毁灭性的反击，是坚不可摧的前线守护者."
[VCP_WarpWarden X2SoldierClassTemplate]
DisplayName="异域界卫"
ClassSummary="异域界卫是一位身披重甲的灵能防御者，手持一面蕴含巨大能量的护盾，保护盟友并掌控战场。他们运用高超的灵能能力，生成屏障、吸收敌人火力，并发动毁灭性的反击，是坚不可摧的前线守护者."

;***************************************
; - GTS UNLOCKS -
;***************************************

;Warp Warden Unlocks
[VCP_WarpWardenUnlocks1 X2SoldierAbilityUnlockTemplate]
DisplayName = "异域界卫: 守护精通 2"
Summary = "所有异域界卫获得守护精通2, 不论军衔."
[VCP_WarpWardenUnlocks2 X2SoldierAbilityUnlockTemplate]
DisplayName = "异域界卫: 守护精通 3"
Summary = "所有异域界卫获得守护精通3, 不论军衔."
[VCP_WarpWardenUnlocks3 X2SoldierAbilityUnlockTemplate]
DisplayName = "异域界卫: 守护精通 4"
Summary = "所有异域界卫获得守护精通4, 不论军衔."

;***************************************
;New Ability Descriptions
;***************************************

;Warp Warden Ability
[VCP_WarpWardenMastery X2AbilityTemplate]
LocFriendlyName = "守护精通"
LocHelpText = " <Ability:ClassName/> 随着经验的积累，其能力得到提升."
LocLongDescription = " <Ability:ClassName/>随着经验的积累，其能力得到提升."
LocPromotionPopupText = "<font color='#CA7200'>等级1</font>获得<Ability:RANKNAME1/> rank [1]<br/><Bullet/>获得<font color='#3ABD23'>挑衅</font> - 迫使目标敌人攻击你.<br/><br/><font color='#CA7200'>等级2</font>获得<Ability:RANKNAME3/> rank [3]<br/><Bullet/>获得<font color='#3ABD23'>异域护盾</font> - 传送到目标位置，并为附近的盟友提供一层屏障.<br/><br/><font color='#CA7200'>等3</font>获得<Ability:RANKNAME5/> rank [5]<br/><Bullet/>获得<font color='#3ABD23'>维持</font> - 每次任务中，若你即将受到致命伤害，则抵消该伤害并进入静滞状态1回合.<br/><br/><font color='#CA7200'>等级4</font>获得<Ability:RANKNAME7/> rank [7]<br/><Bullet/>获得<font color='#3ABD23'>要塞</font> -获得对大多数环境效果免疫."

